
import './_SVG貼圖範例.scss';


export default function SVG貼圖範例() {

    return (
        <article className='SVG貼圖範例'>
            <h3>SVG貼圖範例</h3>
            {/* 元件最外圍 */}
            <svg 
                //代表此為SVG檔案
                xmlns="http://www.w3.org/2000/svg"
                //svg圖案解析度(與外部尺寸無關)
                viewBox="0 0 48 42" 
                className="svgImgSet">
                <path 
                    //用 SVG 的 evenodd 規則判斷填色區域
                    fill-rule="evenodd" 
                    //顏色交給svg的CSS控制
                    fill="currentColor" 
                    //圖案本身
                    d="M38.973,27.409 L47.236,35.988 L37.931,35.988 L35.532,35.988 L23.041,35.988 C20.926,33.892 19.741,32.717 17.626,30.622 L23.041,30.622 L35.532,30.622 L35.532,18.830 L47.236,18.830 L38.973,27.409 ZM47.236,7.231 C42.666,11.761 40.103,14.300 35.532,18.830 L35.532,7.231 L47.236,7.231 ZM6.598,41.469 L0.332,41.469 L0.332,27.337 L0.332,4.646 L0.332,0.530 L32.378,0.530 L32.378,27.337 L6.598,27.337 L6.598,41.469 Z">
                </path>
            </svg>
            {/* 元件最外圍 */}
        </article>
    );
}


